# FilteredElementIdIterator Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilteredElementIdIterator Members
FilteredElementIdIterator Class Methods Properties See Also
---
The FilteredElementIdIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FilteredElementIdIterator |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCurrent | The current element id found by the iterator. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next element id passing the filter. |
| Reset | Resets the iterator to the beginning. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Gets the item at the current position of the iterator. |
| CurrentObject |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FilteredElementIdIterator Class
Autodesk.Revit.DB Namespace